BGCX067/fakit-with-load-nfc-v2-svn-to-git/trunk/FA_5510_USB/TI_DriverLib/MSP430FR57xx/comp_d.c
    //Set the Positive Terminal
    if (COMP_D_VREF != positiveTerminalInput){
        //Enable Positive Terminal Input Mux and Set it to the appropriate input
        HWREG16(baseAddress + OFS_CDCTL0) |= CDIPEN + positiveTerminalInput;

        //Disable the input buffer
        HWREG16(baseAddress + OFS_CDCTL3) |= (1 << positiveTerminalInput);
    } else {
        //Reset and Set COMPD Control 2 Register
        HWREG16(baseAddress + OFS_CDCTL2) = ~(CDRSEL); //Set Vref to go to (+)terminal
    }

    //Set the Negative Terminal
    if (COMP_D_VREF != negativeTerminalInput){
        //Enable Negative Terminal Input Mux and Set it to the appropriate input
        HWREG16(baseAddress + OFS_CDCTL0) |= CDIMEN + (negativeTerminalInput << 8);

        //Disable the input buffer
        HWREG16(baseAddress + OFS_CDCTL3) |= (1 << negativeTerminalInput);
    } else {
        //Reset and Set COMPD Control 2 Register
        HWREG16(baseAddress + OFS_CDCTL2) = CDRSEL; //Set Vref to go to (-) terminal
    }

    //Reset and Set COMPD Control 1 Register
    HWREG16(baseAddress + OFS_CDCTL1) =
        + outputFilterEnableAndDelayLevel //Set the filter enable bit and delay
        + invertedOutputPolarity; //Set the polarity of the output

    return ( retVal) ;
}
//*****************************************************************************
//
//! Generates a Reference Voltage to the terminal selected during initialization.
//!
//! \param baseAddress is the base address of the Comparator module.
//! \param supplyVoltageReferenceBase decides the source and max amount of Voltage that
//!       can be used as a reference.
//!        Valid values are
//!        \b COMP_D_REFERENCE_AMPLIFIER_DISABLED
//!        \b COMP_D_VREFBASE1_5V
//!        \b COMP_D_VREFBASE2_0V
//!        \b COMP_D_VREFBASE2_5V
//!        Modified bits are \b CDREFL of \b CDCTL2 register.
//! \param upperLimitSupplyVoltageFractionOf32 is the numerator of the equation
//!       to generate the reference voltage for the upper limit reference voltage.
//!        Modified bits are \b CDREF1 of \b CDCTL2 register.
//! \param lowerLimitSupplyVoltageFractionOf32 is the numerator of the equation
//!       to generate the reference voltage for the lower limit reference voltage.
//!        Modified bits are \b CDREF0 of \b CDCTL2 register.
//!
//! Use this function to generate a voltage to serve as a reference to the
//! terminal selected at initialization. The voltage is determined by the
//! equation: Vbase * (Numerator / 32). If the upper and lower limit voltage
//! numerators are equal, then a static reference is defined, whereas they are
//! different then a hysteresis effect is generated.
//!
//! \return NONE
//
//*****************************************************************************
void COMP_D_setReferenceVoltage (uint32_t baseAddress,
    uint16_t supplyVoltageReferenceBase,
    uint16_t lowerLimitSupplyVoltageFractionOf32,
    uint16_t upperLimitSupplyVoltageFractionOf32)
{
    assert(supplyVoltageReferenceBase <= COMP_D_VREFBASE2_5V);
    assert(upperLimitSupplyVoltageFractionOf32 <= 32);
    assert(lowerLimitSupplyVoltageFractionOf32 <= 32);
    assert(upperLimitSupplyVoltageFractionOf32
        >= lowerLimitSupplyVoltageFractionOf32);

    HWREG16(baseAddress + OFS_CDCTL1) &= ~(CDMRVS); //Set to VREF0

    //Reset COMPD Control 2 Bits (Except for CDRSEL which is set in Comp_Init() )
    HWREG16(baseAddress + OFS_CDCTL2) &= CDRSEL;

    //Set Voltage Source (Vcc | Vref, resistor ladder or not)
    if (COMP_D_VREFBASE_VCC == supplyVoltageReferenceBase){
        HWREG16(baseAddress + OFS_CDCTL2) |= CDRS_1; //Vcc with resistor ladder
    } else if (lowerLimitSupplyVoltageFractionOf32 == 32){
        //If the lower limit is 32, then the upper limit has to be 32 due to the
        //assertion that upper must be >= to the lower limit. If the numerator is
        //equal to 32, then the equation would be 32/32 == 1, therefore no resistor
        //ladder is needed
        HWREG16(baseAddress + OFS_CDCTL2) |= CDRS_3; //Vref, no resistor ladder
    } else {
        HWREG16(baseAddress + OFS_CDCTL2) |= CDRS_2; //Vref with resistor ladder
    }

    //Set COMPD Control 2 Register
    HWREG16(baseAddress + OFS_CDCTL2) |=
        supplyVoltageReferenceBase //Set Supply Voltage Base
        + ((upperLimitSupplyVoltageFractionOf32 - 1) << 8) //Set Supply Voltage Num.
        + (lowerLimitSupplyVoltageFractionOf32 - 1);
}

//*****************************************************************************
//
//! Sets the reference accuracy 
//!
//! \param baseAddress is the base address of the Comparator module.
//! \param referenceAccuracy is the refrence accuracy setting of the comparator. Clocked
//!      is for low power/low accuracy.
//!      Valid values are
//!      \b COMP_D_ACCURACY_STATIC
//!      \b COMP_D_ACCURACY_CLOCKED
//!      Modified bits are \b CDREFACC of \b CDCTL2 register.
//!
//! The refrence accuracy is set to the desired setting. Clocked is better for low power
//! operations but has a lower accuracy.
//!
//! \return NONE
//
//*****************************************************************************
void COMP_D_setReferenceAccuracy (uint32_t baseAddress,
	uint16_t referenceAccuracy)
{
	assert(
	  (referenceAccuracy == COMP_D_ACCURACY_STATIC) ||
	  (referenceAccuracy == COMP_D_ACCURACY_CLOCKED)
	);
	
    HWREG16(baseAddress + OFS_CDCTL2) &= ~(CDREFACC);
    HWREG16(baseAddress + OFS_CDCTL2) |= referenceAccuracy;
}

//*****************************************************************************
//
//! Enables selected Comparator interrupt sources.
//!
//! \param baseAddress is the base address of the Comparator module.
//! \param mask is the bit mask of the interrupt sources to be enabled.
//!        Mask value is the logical OR of any of the following
//!        \b COMP_D_INTERRUPT_ENABLE - Output interrupt
//!        \b COMP_D_INTERRUPT_ENABLE_INVERTED_POLARITY - Output interrupt inverted polarity
//!
//! Enables the indicated Comparator interrupt sources.  Only the sources that
//! are enabled can be reflected to the processor interrupt; disabled sources
//! have no effect on the processor. <b>Does not clear interrupt flags.</b>
//!
//!
//! \return NONE
//
//*****************************************************************************
void COMP_D_enableInterrupt (uint32_t baseAddress,
    uint16_t interruptMask)
{
    //Set the Interrupt enable bit
    HWREG16(baseAddress + OFS_CDINT) |= interruptMask;
}

//*****************************************************************************
//
//! Disables selected Comparator interrupt sources.
//!
//! \param baseAddress is the base address of the Comparator module.
//! \param mask is the bit mask of the interrupt sources to be disabled.
//!        Mask value is the logical OR of any of the following
//!        \b COMP_D_INTERRUPT_ENABLE - Output interrupt
//!        \b COMP_D_INTERRUPT_ENABLE_INVERTED_POLARITY - Output interrupt inverted polarity
//!
//! Disables the indicated Comparator interrupt sources.  Only the sources that
//! are enabled can be reflected to the processor interrupt; disabled sources
//! have no effect on the processor.
//!
//! \return NONE
//
//*****************************************************************************
void COMP_D_disableInterrupt (uint32_t baseAddress,
    uint16_t interruptMask)
{
    HWREG16(baseAddress + OFS_CDINT) &= ~(interruptMask);
}

//*****************************************************************************
//
//! Clears Comparator interrupt flags.
//!
//! \param baseAddress is the base address of the Comparator module.
//! \param mask is a bit mask of the interrupt sources to be cleared.
//!        Mask value is the logical OR of any of the following
//!        \b COMP_D_INTERRUPT_FLAG - Output interrupt flag
//!        \b COMP_D_INTERRUPT_FLAG_INVERTED_POLARITY - Output interrupt flag inverted polarity
//!
//! The Comparator interrupt source is cleared, so that it no longer asserts.
//! The highest interrupt flag is automatically cleared when an interrupt vector
//! generator is used.
//!
//! \return NONE
//
//*****************************************************************************
void COMP_D_clearInterrupt (uint32_t baseAddress,
    uint16_t interruptFlagMask)
{
    HWREG16(baseAddress + OFS_CDINT) &= ~(interruptFlagMask);
}

//*****************************************************************************
//
//! Gets the current Comparator interrupt status.
//!
//! \param baseAddress is the base address of the Comparator module.
//! \param mask is the masked interrupt flag status to be returned.
//!        Mask value is the logical OR of any of the following
//!        \b COMP_D_INTERRUPT_FLAG - Output interrupt flag
//!        \b COMP_D_INTERRUPT_FLAG_INVERTED_POLARITY - Output interrupt flag inverted polarity
//!
//! This returns the interrupt status for the Comparator module based on which
//! flag is passed.
//!
//! \return The current interrupt flag status for the corresponding mask.
//
//*****************************************************************************
uint8_t COMP_D_getInterruptStatus (uint32_t baseAddress,
    uint16_t interruptFlagMask)
{
    return ( HWREG16(baseAddress + OFS_CDINT) & interruptFlagMask );
}

//*****************************************************************************
//
//! Explicitly sets the edge direction that would trigger an interrupt.
//!
//! \param baseAddress is the base address of the Comparator module.
//! \param edgeDirection determines which direction the edge would have to go to
//!       generate an interrupt based on the non-inverted interrupt flag.
//!        Valid values are
//!        \b COMP_D_FALLINGEDGE - sets the bit to generate an interrupt when the
//!             output of the comparator falls from HIGH to LOW if the normal
//!             interrupt bit is set(and LOW to HIGH if the inverted interrupt
//!             enable bit is set). [Default]
//!        \b COMP_D_RISINGEDGE - sets the bit to generate an interrupt when the
//!             output of the comparator rises from LOW to HIGH if the normal
//!             interrupt bit is set(and HIGH to LOW if the inverted interrupt
//!             enable bit is set).
//!        Modified bits are \b CDIES of \b CDCTL1 register.
//!
//! This function will set which direction the output will have to go, whether
//! rising or falling, to generate an interrupt based on a non-inverted
//! interrupt.
//!
//! \return NONE
//
//*****************************************************************************
void COMP_D_interruptSetEdgeDirection (uint32_t baseAddress,
    unsigned short edgeDirection)
{
    assert(edgeDirection <= COMP_D_RISINGEDGE);

    //Set the edge direction that will trigger an interrupt
    if (COMP_D_RISINGEDGE == edgeDirection){
        HWREG16(baseAddress + OFS_CDCTL1) |= CDIES;
    } else if (COMP_D_FALLINGEDGE == edgeDirection){
        HWREG16(baseAddress + OFS_CDCTL1) &= ~(CDIES);
    }
}

//*****************************************************************************
//
//! Toggles the edge direction that would trigger an interrupt.
//!
//! \param baseAddress is the base address of the Comparator module.
//!
//! This function will toggle which direction the output will have to go,
//! whether rising or falling, to generate an interrupt based on a non-inverted
//! interrupt. If the direction was rising, it is now falling, if it was
//! falling, it is now rising.
//!
//! Modified bits are \b CDIES of \b CDCTL1 register.
//!
//! \return NONE
//
//*****************************************************************************
void COMP_D_interruptToggleEdgeDirection (uint32_t baseAddress)
{
    HWREG16(baseAddress + OFS_CDCTL1) ^= CDIES;
}

//*****************************************************************************
//
//! Turns on the Comparator module.
//!
//! \param baseAddress is the base address of the Comparator module.
//!
//! This function sets the bit that enables the operation of the
//! Comparator module.
//!
//! \return NONE
//
//*****************************************************************************
void COMP_D_enable (uint32_t baseAddress)
{
    HWREG16(baseAddress + OFS_CDCTL1) |= CDON;
}

//*****************************************************************************
//
//! Turns off the Comparator module.
//!
//! \param baseAddress is the base address of the Comparator module.
//!
//! This function clears the CDON bit disabling the operation of the Comparator
//! module, saving from excess power consumption.
//!
//! Modified bits are \b CDON of \b CDCTL1 register.
//! \return NONE
//
//*****************************************************************************
void COMP_D_disable (uint32_t baseAddress)
{
    HWREG16(baseAddress + OFS_CDCTL1) &= ~(CDON);
}

//*****************************************************************************
//
//! Shorts the two input pins chosen during initialization.
//!
//! \param baseAddress is the base address of the Comparator module.
//!
//! This function sets the bit that shorts the devices attached to the input
//! pins chosen from the initialization of the comparator.
//!
//! Modified bits are \b CDSHORT of \b CDCTL1 register.
//! \return NONE
//
//*****************************************************************************
void COMP_D_shortInputs (uint32_t baseAddress)
{
    HWREG16(baseAddress + OFS_CDCTL1) |= CDSHORT;
}

//*****************************************************************************
//
//! Disables the short of the two input pins chosen during initialization.
//!
//! \param baseAddress is the base address of the Comparator module.
//!
//! This function clears the bit that shorts the devices attached to the input
//! pins chosen from the initialization of the comparator.
//!
//! Modified bits are \b CDSHORT of \b CDCTL1 register.
//! \return NONE
//
//*****************************************************************************
void COMP_D_unshortInputs (uint32_t baseAddress)
{
    HWREG16(baseAddress + OFS_CDCTL1) &= ~(CDSHORT);
}

//*****************************************************************************
//
//! Disables the input buffer of the selected input port to effectively allow
//! for analog signals.
//!
//! \param baseAddress is the base address of the Comparator module.
//! \param inputPort is the port in which the input buffer will be disabled.
//!        Valid values are
//!        \b COMP_D_INPUT0 [Default]
//!        \b COMP_D_INPUT1
//!        \b COMP_D_INPUT2
//!        \b COMP_D_INPUT3
//!        \b COMP_D_INPUT4
//!        \b COMP_D_INPUT5
//!        \b COMP_D_INPUT6
//!        \b COMP_D_INPUT7
//!        \b COMP_D_INPUT8
//!        \b COMP_D_INPUT9
//!        \b COMP_D_INPUT10
//!        \b COMP_D_INPUT11
//!        \b COMP_D_INPUT12
//!        \b COMP_D_INPUT13
//!        \b COMP_D_INPUT14
//!        \b COMP_D_INPUT15
//!        \b COMP_D_VREF
//!        Modified bits are \b CDPDx of \b CDCTL3 register.
//!
//! This function sets the bit to disable the buffer for the specified input
//! port to allow for analog signals from any of the comparator input pins. This
//! bit is automatically set when the input is initialized to be used with the
//! comparator module. This function should be used whenever an analog input is
//! connected to one of these pins to prevent parasitic voltage from causing
//! unexpected results.
//!
//! \return NONE
//
//*****************************************************************************
void COMP_D_disableInputBuffer (uint32_t baseAddress,
    uint8_t inputPort)
{
    HWREG16(baseAddress + OFS_CDCTL3) |= (1 << inputPort);
}

//*****************************************************************************
//
//! Enables the input buffer of the selected input port to allow for digital
//! signals.
//!
//! \param baseAddress is the base address of the Comparator module.
//! \param inputPort is the port in which the input buffer will be enabled.
//!        Valid values are
//!        \b COMP_D_INPUT0 [Default]
//!        \b COMP_D_INPUT1
//!        \b COMP_D_INPUT2
//!        \b COMP_D_INPUT3
//!        \b COMP_D_INPUT4
//!        \b COMP_D_INPUT5
//!        \b COMP_D_INPUT6
//!        \b COMP_D_INPUT7
//!        \b COMP_D_INPUT8
//!        \b COMP_D_INPUT9
//!        \b COMP_D_INPUT10
//!        \b COMP_D_INPUT11
//!        \b COMP_D_INPUT12
//!        \b COMP_D_INPUT13
//!        \b COMP_D_INPUT14
//!        \b COMP_D_INPUT15
//!        \b COMP_D_VREF
//!        Modified bits are \b CDPDx of \b CDCTL3 register.
//!
//! This function clears the bit to enable the buffer for the specified input
//! port to allow for digital signals from any of the comparator input pins.
//! This should not be reset if there is an analog signal connected to the
//! specified input pin to prevent from unexpected results.
//!
//! \return NONE
//
//*****************************************************************************
void COMP_D_enableInputBuffer (uint32_t baseAddress, 
	uint8_t inputPort)
{
    HWREG16(baseAddress + OFS_CDCTL3) &= ~(1 << inputPort);
}

//*****************************************************************************
//
//! Toggles the bit that swaps which terminals the inputs go to, while also
//! inverting the output of the comparator.
//!
//! \param baseAddress is the base address of the Comparator module.
//!
//! This function toggles the bit that controls which input goes to which
//! terminal. After initialization, this bit is set to 0, after toggling it once
//! the inputs are routed to the opposite terminal and the output is inverted.
//!
//! Modified bits are \b CDEX of \b CDCTL1 register.
//! \return NONE
//
//*****************************************************************************
void COMP_D_IOSwap (uint32_t baseAddress)
{
    HWREG16(baseAddress + OFS_CDCTL1) ^= CDEX; //Toggle CDEX bit
}

//*****************************************************************************
//
//! Returns the output value of the Comparator module.
//!
//! \param baseAddress is the base address of the Comparator module.
//!
//! Returns the output value of the Comparator module.
//!
//! \return COMP_D_HIGH or COMP_D_LOW as the output value of the Comparator module.
//
//*****************************************************************************
unsigned short COMP_D_outputValue (uint32_t baseAddress)
{
    if ( HWREG16(baseAddress + OFS_CDCTL1) & CDOUT){
        return ( COMP_D_HIGH) ;
    } else {
        return ( COMP_D_LOW) ;
    }
}

//*****************************************************************************
//
//Close the Doxygen group.
//! @}
//
//*****************************************************************************
